#!/bin/bash

# 打印uplooking

arr=(0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 1 0 1 1 1 1 0 1 0 0 0 0 0 1 1 0 0 0 1 1 0 0 1 0 0 1 0 1 1 1 1 0 1 0 0 1 0 0 1 1 1 0 0 1 0 0 1 0 1 0 0 1 0 1 0 0 0 0 1 0 0 1 0 1 0 0 1 0 1 1 1 0 0 0 1 1 0 0 1 1 0 1 0 1 0 0 0 0 0 1 0 0 1 0 1 1 1 1 0 1 0 0 0 0 1 0 0 1 0 1 0 0 1 0 1 1 1 0 0 0 1 1 0 0 1 0 1 1 0 1 0 1 1 0 0 0 1 1 0 0 1 0 0 0 0 1 1 1 1 0 0 1 1 0 0 0 1 1 0 0 1 0 0 1 0 1 1 1 1 0 1 0 0 1 0 0 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0)


hanshu() {
	for (( i=0; i<${#arr[@]}; i++ )); do
		[ ${arr[$i]} -eq 0 ] && echo -n ' ' || echo -n '#'
	done
	echo ''
}

#len=${#arr[@]}
width=46
height=6
for (( i=0; i<$height; i++ )); do
	start=$(( $i * $width ))
	#end=$(( $start + $width - 1 ))
	#hanshu | cut -c "$start-$end"
	for j in ${arr[@]:$start:$width};do
		[ $j -eq 0 ] && echo -n ' ' || echo -n '#'
	done
	echo ''
done

